Repository: rv1344/TocoAce-Interview-Coach-AI
Catalog: TocoAce – Interview Coach AI/Resources/*.lproj/Localizable.strings
Languages: kk, sv

# interviews_left
source: left
kk: қалды
sv: kvar

source: Settings
kk: Баптаулар
sv: Inställningar

# configure_warning
source: Please configure your settings before starting
kk: Бастамас бұрын баптауларды орнатыңыз
sv: Konfigurera dina inställningar innan du börjar

source: Open Settings
kk: Баптауларды ашу
sv: Öppna inställningar

source: Start Recording
kk: Жазуды бастау
sv: Starta inspelning

source: Stop Recording
kk: Жазуды тоқтату
sv: Stoppa inspelning

source: Recording
kk: Жазу
sv: Spelar in

source: Live Transcription
kk: Тікелей транскрипция
sv: Live-transkribering

# transcription_placeholder
source: Start recording to see transcription...
kk: Транскрипцияны көру үшін жазуды бастаңыз...
sv: Starta inspelning för att se transkribering...

source: Generate Answer
kk: Жауап жасау
sv: Generera svar

source: Generated Answer
kk: Жасалған жауап
sv: Genererat svar

# answer_placeholder
source: Click 'Generate Answer' to get a response...
kk: Нәтижені алу үшін 'Жауап жасау' түймесін басыңыз...
sv: Klicka 'Generera svar' för att få resultat...

# generating
source: Generating answer...
kk: Жауап жасалуда...
sv: Genererar svar...

source: Copy
kk: Көшіру
sv: Kopiera

source: Regenerate
kk: Қайта жасау
sv: Generera igen

# answer_copied
source: Answer copied to clipboard!
kk: Жауап алмасу буферіне көшірілді!
sv: Svar kopierat till urklipp!

source: AI Engine
kk: AI Қозғалтқышы
sv: AI-motor

source: Select Engine
kk: Қозғалтқышты таңдау
sv: Välj motor

source: Anthropic API Key
kk: Anthropic API кілті
sv: Anthropic API-nyckel

source: OpenAI API Key
kk: OpenAI API кілті
sv: OpenAI API-nyckel

source: Answer Length
kk: Жауап ұзындығы
sv: Svarslängd

source: Short
kk: Қысқа
sv: Kort

source: Medium
kk: Орташа

source: Long
kk: Ұзын
sv: Lång

source: Job Details
kk: Жұмыс туралы мәліметтер
sv: Jobbdetaljer

source: Position Level
kk: Позиция деңгейі
sv: Positionsnivå

source: Position Title
kk: Позиция атауы
sv: Befattning

# position_title_placeholder
source: e.g., Senior iOS Developer
kk: мысалы, Senior iOS әзірлеуші
sv: t.ex., Senior iOS-utvecklare

source: Company Name
kk: Компания атауы
sv: Företagsnamn

# company_placeholder
source: e.g., Apple Inc.
kk: мысалы, Apple Inc.
sv: t.ex., Apple Inc.

source: Job Description
kk: Жұмыс сипаттамасы
sv: Jobbbeskrivning

source: Resume
kk: Резюме
sv: CV

source: Upload Resume
kk: Резюме жүктеу
sv: Ladda upp CV

source: Replace Resume
kk: Резюмені ауыстыру
sv: Ersätt CV

source: characters
kk: таңба
sv: tecken

# resume_uploaded
source: Resume uploaded successfully!
kk: Резюме сәтті жүктелді!
sv: CV uppladdad!

# parse_error
source: Failed to parse document. Please try a different file.
kk: Құжатты өңдеу мүмкін болмады. Басқа файлды көріңіз.
sv: Kunde inte bearbeta dokumentet. Försök med en annan fil.

# upgrade_plan
source: Upgrade Your Plan
kk: Жоспарды жаңарту
sv: Uppgradera plan

# upgrade_subtitle
source: Get more interviews and ace your career goals
kk: Көбірек сұхбат алып, мансаптық мақсаттарыңызға жетіңіз
sv: Få fler intervjuer och nå dina karriärmål

source: Current Plan
kk: Ағымдағы жоспар
sv: Nuvarande plan

source: Interviews Remaining
kk: Сұхбаттар қалды
sv: Intervjuer kvar

source: Purchase
kk: Сатып алу
sv: Köp

source: Restore Purchases
kk: Сатып алуларды қалпына келтіру
sv: Återställ köp

source: Purchases restored!
kk: Сатып алулар қалпына келтірілді!
sv: Köp återställda!

# purchase_success
source: Purchase successful! Thank you!
kk: Сатып алу сәтті! Рақмет!
sv: Köp lyckades! Tack!

source: Close
kk: Жабу
sv: Stäng

source: Loading products...
kk: Өнімдер жүктелуде...
sv: Laddar produkter...

# no_interviews
source: You have no interviews remaining. Please upgrade your plan.
kk: Сұхбаттарыңыз қалмады. Жоспарыңызды жаңартыңыз.
sv: Du har inga intervjuer kvar. Uppgradera din plan.

# permission_required
source: Please grant microphone and speech recognition permissions in System Settings.
kk: Жүйелік баптауларда микрофон мен сөйлеуді тану рұқсаттарын беріңіз.
sv: Ge tillgång till mikrofon och taligenkänning i Systeminställningar.

source: API key not configured
kk: API кілті орнатылмаған
sv: API-nyckel inte konfigurerad

# generation_failed
source: Failed to generate answer
kk: Жауап жасау мүмкін болмады
sv: Kunde inte generera svar

source: Done
kk: Дайын
sv: Klar

source: Cancel
kk: Болдырмау
sv: Avbryt

source: Success
kk: Сәтті
sv: Lyckades

source: Error
kk: Қате
sv: Fel
